libxmlbus/data/wsaddr-testset/submissions/IBM/wsa-fault-tests/soap11/duplicateReplyToRequest.xml

<?xml version='1.0' ?>
<soap11:Envelope xmlns:soap11="http://schemas.xmlsoap.org/soap/envelope/"
                 xmlns:wsa="http://www.w3.org/2005/08/addressing">
 <soap11:Header>
  <wsa:Action>http://example.org/action/echoIn</wsa:Action>
  <wsa:MessageID>http://message.id/test</wsa:MessageID>
  <wsa:ReplyTo>
   <wsa:Address>http://www.w3.org/2005/08/addressing/anonymous</wsa:Address>
  </wsa:ReplyTo>
  <wsa:ReplyTo>
   <wsa:Address>http://www.w3.org/2005/08/addressing/anonymous</wsa:Address>
  </wsa:ReplyTo>
 </soap11:Header>
 <soap11:Body>
  <m:echo xmlns:m="http://example.org/echo">Echo This Text</m:echo>
 </soap11:Body>
</soap11:Envelope>
